UT_Marketplaces.Marketplaces/src/InformationRegisters/НоменклатураЗагруженнаяНаТСД/НоменклатураЗагруженнаяНаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НоменклатураЗагруженнаяНаТСД</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.ОбменДаннымиМобильноеПриложение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_СтатусыДокументовВТСД/рар_мп_СтатусыДокументовВТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_СтатусыДокументовВТСД</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/ТипыСкладскихЯчеек/ТипыСкладскихЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ced20a30-7d1b-431b-8276-e247307df415">
  <name>ТипыСкладскихЯчеек</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="cf81110b-4c80-447e-9456-a2b84197b1df">
    <name>Приемка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Documents/рар_мп_РеестрЗаказов/рар_мп_РеестрЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рар_мп_РеестрЗаказов</name>
  <attributes>
    <name>рар_мп_АккаунтМаркетплейса</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Wildberries_НомерПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ЗапрещеноИзменятьСоставаРеестра</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_СтатусДокументаВТСД</name>
    <type>
      <types>EnumRef.рар_мп_СтатусыДокументовВТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ПользовательТСД</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>рар_мп_ЗаказыИзМаркетплейса</name>
    <attributes>
      <name>рар_мп_Заказ</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СтатусЗаказа</name>
      <type>
        <types>EnumRef.рар_мп_ЯндексМаркет_СтатусыЗаказов</types>
        <types>EnumRef.рар_мп_Ozon_СтатусыЗаказов</types>
        <types>EnumRef.рар_мп_Wildberries_СтатусыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СтатусОбработкиЗаказа</name>
      <type>
        <types>EnumRef.рар_мп_Ozon_ПодстатусыЗаказов</types>
        <types>EnumRef.рар_мп_ЯндексМаркет_ПодстатусыЗаказов</types>
        <types>EnumRef.рар_мп_Wildberries_СтатусыОбработкиЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ПечатьЭтикетки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СкачатьЭтикетку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_ПередачаНаКомиссию</name>
    <attributes>
      <name>рар_мп_Заказ</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ПередачаНаКомиссию</name>
      <type>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_ТоварыИзЗаказов</name>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СтрокаИзТЧТовары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_Коробки</name>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Коробка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_РаспределенныеТовары</name>
    <attributes>
      <name>рар_мп_Коробка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СтрокаИзТЧТовары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_МаркируемыеТовары</name>
    <attributes>
      <name>рар_мп_НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_СтрокаИзТЧТовары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Exemplar_Id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_IDТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЗаполнениеМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЧестныйЗнак</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЗаполнениеГТД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_КоличествоГрузовыхМест</name>
    <attributes>
      <name>рар_мп_ИдентификаторСклада</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_КоличествоГрузовыхМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="09a12ed1-441d-49a8-9f36-2093735e8d37">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

UT_Marketplaces.Marketplaces/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="07b3c407-9a3a-4f94-b798-226c96d66840">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="4f41c975-1f0d-4d95-b6fc-9938d4d8d4ff">
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f459e2e3-93ba-4b46-9b48-38ca910f782c">
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6e8f132c-946f-45cd-bc8f-57819f36624e">
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8447539a-9f16-4fa7-9ce9-c5b28e7d9e4f">
    <name>ИспользоватьСкладскиеПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

UT_Marketplaces.Marketplaces/src/CommonModules/Обмен/Module.bsl
#Область РегистрацияДанныхКОбмену

Процедура ЗарегистрироватьИзмененияДанных(УзелОбмена, ЗагружатьВсюНоменклатуруВТСД = Ложь) Экспорт	
	СоставПланаОбмена = УзелОбмена.Метаданные().Состав;	
	Для Каждого ЭлементСоставаПланаОбмена Из СоставПланаОбмена Цикл
		Если ЭлементСоставаПланаОбмена.АвтоРегистрация=АвтоРегистрацияИзменений.Разрешить Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,ЭлементСоставаПланаОбмена.Метаданные);
		КонецЕсли;
	КонецЦикла;
	Если Константы.ЗагружатьВсюНоменклатуруВТСД.Получить() или ЗагружатьВсюНоменклатуруВТСД Тогда  
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,Метаданные.Справочники.Номенклатура);
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,Метаданные.Справочники.ХарактеристикиНоменклатуры);
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,Метаданные.Справочники.УпаковкиЕдиницыИзмерения);
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры);
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,Метаданные.Справочники.ШтрихкодыУпаковокТоваров);
	Иначе 
		МассивСсылок=СформироватьМассивСсылокБазовыхЕдиницИзмерения();
		Если МассивСсылок.Количество() Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,МассивСсылок);
		КонецЕсли;
	КонецЕсли;
	
	ЗарегистрироватьДокументыКОбмену(УзелОбмена);
КонецПроцедуры

Процедура ЗарегистрироватьДокументыКОбмену(УзелОбмена)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_РеестрЗаказов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.рар_мп_РеестрЗаказов КАК рар_мп_РеестрЗаказов
		|ГДЕ
		|	(рар_мп_РеестрЗаказов.рар_мп_СтатусДокументаВТСД = &СтатусНовый
		|	ИЛИ рар_мп_РеестрЗаказов.рар_мп_СтатусДокументаВТСД = &СтатусВРаботе)
		|	И рар_мп_РеестрЗаказов.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	(ЗаказКлиента.рар_мп_СтатусДокументаВТСД = &СтатусНовый
		|	ИЛИ ЗаказКлиента.рар_мп_СтатусДокументаВТСД = &СтатусВРаботе)
		|	И ЗаказКлиента.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("СтатусНовый", Перечисления.рар_мп_СтатусыДокументовВТСД.Новый);
	Запрос.УстановитьПараметр("СтатусВРаботе", Перечисления.рар_мп_СтатусыДокументовВТСД.ВРаботе);
	
	ТЗРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивСсылок = ТЗРезультатЗапроса.ВыгрузитьКолонку("Ссылка");
	
	Если МассивСсылок.Количество() > 0 Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, МассивСсылок); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьВсеОбъектыКОбменуДляВсехУзлов() Экспорт	
	
	Набор=РегистрыСведений.НоменклатураЗагруженнаяНаТСД.СоздатьНаборЗаписей();
	Набор.Записать(Истина);
	
	
	МассивУзлов=СформироватьМассивУзловДляРегистрации();
	Для каждого Узел из МассивУзлов Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Узел);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтменитьРегистрациюВсехОбъектовКОбменуДляВсехУзлов() Экспорт	
		
	МассивУзлов=СформироватьМассивУзловДляРегистрации();
	Для каждого Узел из МассивУзлов Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Новый УдалениеОбъекта(ВыборкаДетальныеЗаписи.Ссылка));
	КонецЦикла;
	
КонецПроцедуры

Процедура РегистрацияКОбменуСТСДПередЗаписью(Источник, Отказ) Экспорт
	Если Источник.ЭтоНовый() Тогда   
		НовыйГУИД  = Новый УникальныйИдентификатор();
		НоваяСсылка = Справочники[Источник.Метаданные().Имя].ПолучитьСсылку(НовыйГУИД);
		Источник.УстановитьСсылкуНового(НоваяСсылка); 
	ИНаче
		НоваяСсылка=Источник.Ссылка;
	КонецЕсли;
	
	Если ТипЗнч(Источник)=Тип("СправочникОбъект.УпаковкиЕдиницыИзмерения") 
			и Источник.Владелец=Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения  Тогда 			
		МассивУзлов=СформироватьМассивУзловДляРегистрации();
		Если МассивУзлов.Количество() Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,НоваяСсылка);
		КонецЕсли;
	ИначеЕсли Константы.ЗагружатьВсюНоменклатуруВТСД.Получить() 
			и (ТипЗнч(Источник)=Тип("СправочникОбъект.Номенклатура") 
				или ТипЗнч(Источник)=Тип("СправочникОбъект.УпаковкиЕдиницыИзмерения") 
				или ТипЗнч(Источник)=Тип("СправочникОбъект.ХарактеристикиНоменклатуры")
				или ТипЗнч(Источник)=Тип("СправочникОбъект.ШтрихкодыУпаковокТоваров")) Тогда
		МассивУзлов=СформироватьМассивУзловДляРегистрации();		
		Если МассивУзлов.Количество() Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,НоваяСсылка);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник)=Тип("СправочникОбъект.УпаковкиЕдиницыИзмерения") 
			и НЕ Источник.Владелец=Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения 
			и НЕ Константы.ЗагружатьВсюНоменклатуруВТСД.Получить()Тогда
		МассивУзлов=РегистрыСведений.НоменклатураЗагруженнаяНаТСД.ПолучитьУзлыДляНоменклатуры(Источник.Владелец);
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,НоваяСсылка);
	ИначеЕсли ТипЗнч(Источник)=Тип("СправочникОбъект.ХарактеристикиНоменклатуры") 
			и НЕ ТипЗнч(Источник.Владелец)=Тип("СправочникСсылка.ВидыНоменклатуры") 
			и НЕ Константы.ЗагружатьВсюНоменклатуруВТСД.Получить()Тогда     	
		МассивУзлов=РегистрыСведений.НоменклатураЗагруженнаяНаТСД.ПолучитьУзлыДляНоменклатуры(Источник.Владелец);
		Если МассивУзлов.Количество() Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,НоваяСсылка);
		КонецЕсли;
	ИначеЕсли (ТипЗнч(Источник)=Тип("СправочникОбъект.Номенклатура")
			или ТипЗнч(Источник)=Тип("СправочникОбъект.ШтрихкодыУпаковокТоваров"))
			и НЕ Константы.ЗагружатьВсюНоменклатуруВТСД.Получить()Тогда
		МассивУзлов=РегистрыСведений.НоменклатураЗагруженнаяНаТСД.ПолучитьУзлыДляНоменклатуры(Источник.Ссылка);
		Если МассивУзлов.Количество() Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,НоваяСсылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура РегистрацияШтрихкодовКОбменуПриЗаписи(Источник, Отказ, Замещение) Экспорт
	Если Константы.ЗагружатьВсюНоменклатуруВТСД.Получить() Тогда 
		МассивУзлов=СформироватьМассивУзловДляРегистрации();
		Если МассивУзлов.Количество() Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник);  
		КонецЕсли;
	Иначе
		Для каждого Запись из Источник Цикл
			МассивУзлов=РегистрыСведений.НоменклатураЗагруженнаяНаТСД.ПолучитьУзлыДляНоменклатуры(Запись.Номенклатура);  
			Если МассивУзлов.Количество() Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗарегистрироватьНоменклатуруИСвязанныеОбъекты(Узел,Номенклатура) Экспорт
	ПланыОбмена.ЗарегистрироватьИзменения(Узел,Номенклатура);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмеренияИзменения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмеренияИзменения
		|ГДЕ
		|	УпаковкиЕдиницыИзмеренияИзменения.Владелец = &Владелец
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыИзменения.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатурыИзменения
		|ГДЕ
		|	ХарактеристикиНоменклатурыИзменения.Владелец = &Владелец
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваровИзменения.Ссылка
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваровИзменения
		|ГДЕ
		|	ШтрихкодыУпаковокТоваровИзменения.Номенклатура = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	МассивСсылок=ТЗ.ВыгрузитьКолонку("Ссылка");	
	Если МассивСсылок.Количество() Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел,МассивСсылок); 
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Набор=РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей(); 
		Набор.Отбор.Штрихкод.Установить(ВыборкаДетальныеЗаписи.Штрихкод);
		Набор.Прочитать();
		ПланыОбмена.ЗарегистрироватьИзменения(Узел,Набор);
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьМассивУзловДляРегистрации()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменДаннымиМобильноеПриложение.Ссылка КАК Узел
		|ИЗ
		|	ПланОбмена.ОбменДаннымиМобильноеПриложение КАК ОбменДаннымиМобильноеПриложение
		|ГДЕ
		|	НЕ ОбменДаннымиМобильноеПриложение.ЭтотУзел";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	МассивУзлов=ТЗ.ВыгрузитьКолонку("Узел");
	Возврат МассивУзлов;
КонецФункции

Функция СформироватьМассивСсылокБазовыхЕдиницИзмерения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Возврат ТЗ.ВыгрузитьКолонку("ЕдиницаИзмерения");
КонецФункции

Функция ПолучитьУзелПользователяВМассиве(Пользователь)
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменДаннымиМобильноеПриложение.Ссылка КАК Узел
		|ИЗ
		|	ПланОбмена.ОбменДаннымиМобильноеПриложение КАК ОбменДаннымиМобильноеПриложение
		|ГДЕ
		|	НЕ ОбменДаннымиМобильноеПриложение.ЭтотУзел
		|	И ОбменДаннымиМобильноеПриложение.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		МассивУзлов.Добавить(Выборка.Узел);
	КонецЕсли;
	
	Возврат МассивУзлов;
КонецФункции

Функция СформироватьМассивУзловДляРегистрацииЗаИсключениемПользователя(Пользователь)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменДаннымиМобильноеПриложение.Ссылка КАК Узел
		|ИЗ
		|	ПланОбмена.ОбменДаннымиМобильноеПриложение КАК ОбменДаннымиМобильноеПриложение
		|ГДЕ
		|	НЕ ОбменДаннымиМобильноеПриложение.ЭтотУзел
		|	И ОбменДаннымиМобильноеПриложение.Пользователь <> &Пользователь"; 
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	МассивУзлов=ТЗ.ВыгрузитьКолонку("Узел");
	Возврат МассивУзлов;
КонецФункции

#КонецОбласти

Функция СформироватьМассивСсылокКОбмену(УзелОбмена,РазмерПакета)

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииИзменения.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Выгру
		|ИЗ
		|	Справочник.Организации.Изменения КАК ОрганизацииИзменения
		|ГДЕ
		|	ОрганизацииИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыНоменклатурыИзменения.Ссылка
		|ИЗ
		|	Справочник.ВидыНоменклатуры.Изменения КАК ВидыНоменклатурыИзменения
		|ГДЕ
		|	ВидыНоменклатурыИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СкладскиеПомещенияИзменения.Ссылка
		|ИЗ
		|	Справочник.СкладскиеПомещения.Изменения КАК СкладскиеПомещенияИзменения
		|ГДЕ
		|	СкладскиеПомещенияИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СкладыИзменения.Ссылка
		|ИЗ
		|	Справочник.Склады.Изменения КАК СкладыИзменения
		|ГДЕ
		|	СкладыИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураИзменения.Ссылка
		|ИЗ
		|	Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
		|ГДЕ
		|	НоменклатураИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмеренияИзменения.Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения.Изменения КАК УпаковкиЕдиницыИзмеренияИзменения
		|ГДЕ
		|	УпаковкиЕдиницыИзмеренияИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СкладскиеЯчейкиИзменения.Ссылка
		|ИЗ
		|	Справочник.СкладскиеЯчейки.Изменения КАК СкладскиеЯчейкиИзменения
		|ГДЕ
		|	СкладскиеЯчейкиИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СерииНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.СерииНоменклатуры.Изменения КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыИзменения.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.Изменения КАК ХарактеристикиНоменклатурыИзменения
		|ГДЕ
		|	ХарактеристикиНоменклатурыИзменения.Узел = &Узел 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваровИзменения.Ссылка
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров.Изменения КАК ШтрихкодыУпаковокТоваровИзменения
		|ГДЕ
		|	ШтрихкодыУпаковокТоваровИзменения.Узел = &Узел
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ %РазмерПакета%
		|	ВТ_Выгру.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_Выгру КАК ВТ_Выгру";
	
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"%РазмерПакета%",Формат(РазмерПакета,"ЧГ=0"));
	Запрос.УстановитьПараметр("Узел", УзелОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Тз = РезультатЗапроса.Выгрузить();
	
	
	Возврат Тз.ВыгрузитьКолонку("Ссылка");


КонецФункции

Функция СформироватьНаборЗаписейКОбмену(УзелОбмена,РазмерПакета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатурыИзменения.Штрихкод КАК Штрихкод
		|ПОМЕСТИТЬ ВТ_Выгру
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры.Изменения КАК ШтрихкодыНоменклатурыИзменения
		|ГДЕ
		|	ШтрихкодыНоменклатурыИзменения.Узел = &Узел
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ %РазмерПакета%
		|	ВТ_Выгру.Штрихкод КАК Штрихкод
		|ИЗ
		|	ВТ_Выгру КАК ВТ_Выгру";
	
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"%РазмерПакета%",Формат(РазмерПакета,"ЧГ=0"));
	Запрос.УстановитьПараметр("Узел", УзелОбмена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивНабораЗаписей = Новый Массив;
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Штрихкод.Установить(Выборка.Штрихкод); 
		
		МассивНабораЗаписей.Добавить(НаборЗаписей);
	КонецЦикла;
	
	
	Возврат МассивНабораЗаписей;

КонецФункции

Функция СформироватьПакетОбмена(УзелОбмена,РазмерПакета) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();	
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");
	ФильтрВыборки=СформироватьМассивСсылокКОбмену(УзелОбмена,РазмерПакета);
	
	Если ФильтрВыборки.Количество() = 0 Тогда
		ФильтрВыборки = СформироватьНаборЗаписейКОбмену(УзелОбмена,РазмерПакета);
	КонецЕсли;
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения,ФильтрВыборки);
	
	Пока ВыборкаИзменений.Следующий() Цикл		
		Данные = ВыборкаИзменений.Получить();
		// Если перенос данных не нужен, то, возможно, необходимо записать удаление данных.	
		Если Не НуженПереносДанных(Данные, УзелОбмена) Тогда
			// Получаем значение с возможным удалением данных.			
			УдалениеДанных(Данные);
		КонецЕсли;		
		// Записываем данные в сообщение	
		ЗаписатьДанные(ЗаписьXML, Данные, УзелОбмена);   
	КонецЦикла;
	ЗаписьСообщения.ЗакончитьЗапись();
	ЗакрытаяЗапись = ЗаписьXML.Закрыть();    	
	Возврат Новый ХранилищеЗначения(ЗакрытаяЗапись, Новый СжатиеДанных(9));	
КонецФункции

Функция НуженПереносДанных(Данные, УзелОбмена) Экспорт	
	Перенос = Истина;
	
	Если ТипЗнч(Данные) = Тип("СправочникОбъект.Пользователи") Тогда		
		Если Не УзелОбмена.Пользователь.Пустая() И Данные.Ссылка <> УзелОбмена.Пользователь Тогда			
			Перенос = Ложь;		
		КонецЕсли;		
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.СкладскиеЯчейки") Тогда
		Если Данные.ТипСкладскойЯчейки <> Перечисления.ТипыСкладскихЯчеек.Приемка 
			и Данные.ТипСкладскойЯчейки <> Перечисления.ТипыСкладскихЯчеек.Хранение  Тогда 
			Перенос = Ложь;	
		КонецЕсли; 
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Номенклатура") и НЕ Константы.ЗагружатьВсюНоменклатуруВТСД.Получить() Тогда
		УдалитьНоменклатуруНаУзле=НЕ РегистрыСведений.НоменклатураЗагруженнаяНаТСД.НоменклатураЗагружаетсяНаУзел(Данные.Ссылка,УзелОбмена); 
		Если УдалитьНоменклатуруНаУзле Тогда
			Данные=Новый УдалениеОбъекта(Данные.Ссылка);
		КонецЕсли;
		Перенос = Истина;
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ЗаказКлиента") 
		  ИЛИ ТипЗнч(Данные) = Тип("ДокументОбъект.рар_мп_РеестрЗаказов") Тогда 
		   
		Если Данные.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.ВРаботе
			И Данные.рар_мп_ПользовательТСД <> УзелОбмена.Пользователь Тогда
			Возврат Ложь;   
		ИначеЕсли Данные.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Завершен Тогда 
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Перенос;	
КонецФункции

Процедура УдалениеДанных(Данные) Экспорт
	// Получаем объект описания метаданного, соответствующий данным.
	ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) ИЛИ Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		// Перенос удаления объекта для объектных.
		Данные = Новый УдалениеОбъекта(Данные.Ссылка);
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда		
		// Очищаем данные.
		Данные.Очистить();
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьДанные(ЗаписьXML, Данные, УзелОбмена) Экспорт

	Если ТипЗнч(Данные) = Тип("СправочникОбъект.Пользователи") Тогда
		ЗаписатьXMLПользователь(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.УпаковкиЕдиницыИзмерения")  Тогда
		ЗаписатьXMLЕдИзм(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Склады") Тогда
		ЗаписатьXMLСклады(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Организации") Тогда
		ЗаписатьXMLОрганизации(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ВидыНоменклатуры") Тогда
		ЗаписатьXMLВидыНоменклатуры(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.СкладскиеЯчейки") Тогда
		ЗаписатьXMLСкладскиеЯчейки(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.СкладскиеПомещения") Тогда
		ЗаписатьXMLСкладскиеПомещения(ЗаписьXML, Данные); 
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Номенклатура") Тогда
		ЗаписатьXMLНоменклатура(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ХарактеристикиНоменклатуры") Тогда
		ЗаписатьXMLХарактеристикаНоменклатуры(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.СерииНоменклатуры") Тогда
		ЗаписатьXMLСерию(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("УдалениеОбъекта") 
		и ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		ЗаписатьXMLНоменклатураУдаление(ЗаписьXML, Данные.Ссылка);
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		ЗаписатьXMLЗаказКлиента(ЗаписьXML, Данные, УзелОбмена.Пользователь); 
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.рар_мп_РеестрЗаказов") Тогда
		ЗаписатьXMLРеестрЗаказов(ЗаписьXML, Данные, УзелОбмена.Пользователь); 
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ШтрихкодыУпаковокТоваров") Тогда
		ЗаписатьXMLШтрихкодыУпаковокТоваров(ЗаписьXML, Данные);  
	Иначе                       
		//Записываем данные с помощью стандартного метода.
		ЗаписатьXML(ЗаписьXML, Данные);
	КонецЕсли
КонецПроцедуры

#Область ЗаписьДанных
Процедура ЗаписатьXMLПользователь(ЗаписьXML, Пользователь)Экспорт
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Пользователь.Вручную");
	
	ЗаписатьXML(ЗаписьXML, Пользователь.Ссылка, "Ref", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, Пользователь.Код, "Code", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, Пользователь.Наименование, "Description", НазначениеТипаXML.Явное);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLСклады(ЗаписьXML, Склады)Экспорт
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Склады.Вручную");
	
	ЗаписатьXML(ЗаписьXML, Склады.Ссылка, "Ref", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, Склады.ЭтоГруппа, "IsGroup", НазначениеТипаXML.Явное);	
	ЗаписатьXML(ЗаписьXML, Склады.Наименование, "Description", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, Склады.Родитель, "Parent", НазначениеТипаXML.Явное);
	
	Если НЕ Склады.ЭтоГруппа Тогда		
		ЗаписатьXML(ЗаписьXML, Склады.ИспользоватьОрдернуюСхемуПриОтгрузке, "ИспользоватьОрдернуюСхемуПриОтгрузке", НазначениеТипаXML.Явное);
		ЗаписатьXML(ЗаписьXML, Склады.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач, "ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач", НазначениеТипаXML.Явное); 
		ЗаписатьXML(ЗаписьXML, Склады.ИспользоватьОрдернуюСхемуПриПоступлении, "ИспользоватьОрдернуюСхемуПриПоступлении", НазначениеТипаXML.Явное);
		ЗаписатьXML(ЗаписьXML, Склады.ИспользоватьСкладскиеПомещения, "ИспользоватьСкладскиеПомещения", НазначениеТипаXML.Явное);
	КонецЕсли;	
		
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLВидыНоменклатуры(ЗаписьXML, ВидыНоменклатуры) Экспорт
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ВидыНоменклатуры.Вручную");
	
	ЗаписатьXML(ЗаписьXML, ВидыНоменклатуры.Ссылка, "Ref", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, ВидыНоменклатуры.ЭтоГруппа, "IsGroup", НазначениеТипаXML.Явное);	
	ЗаписатьXML(ЗаписьXML, ВидыНоменклатуры.Наименование, "Description", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, ВидыНоменклатуры.Родитель, "Parent", НазначениеТипаXML.Явное);
	Если НЕ ВидыНоменклатуры.ЭтоГруппа Тогда
		ЗаписатьXML(ЗаписьXML, ВидыНоменклатуры.ИспользоватьСерии, "ИспользоватьСерии", НазначениеТипаXML.Явное);
		ЗаписатьXML(ЗаписьXML, ВидыНоменклатуры.ИспользоватьХарактеристики, "ИспользоватьХарактеристики", НазначениеТипаXML.Явное);
		ЗаписатьXML(ЗаписьXML, ВидыНоменклатуры.ИспользованиеХарактеристик, "ИспользованиеХарактеристик", НазначениеТипаXML.Явное);
		ЗаписатьXML(ЗаписьXML, ВидыНоменклатуры.ВладелецХарактеристик, "ВладелецХарактеристик", НазначениеТипаXML.Явное);
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLЕдИзм(ЗаписьXML, УпаковкиЕдиницыИзмерения) Экспорт
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.УпаковкиЕдиницыИзмерения.Вручную");
	
	СтруктураРеквизитов=РаботаСоСправочниками.ПолучитьСтруктуруУпаковки(УпаковкиЕдиницыИзмерения.Ссылка);
	
	РаботаСоСправочниками.СтруктуруВЗаписьXML(ЗаписьXML,СтруктураРеквизитов);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLОрганизации(ЗаписьXML, Организации)Экспорт
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Организации.Вручную");
	
	ЗаписатьXML(ЗаписьXML, Организации.Ссылка, "Ref", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, Организации.Наименование, "Description", НазначениеТипаXML.Явное);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLСкладскиеЯчейки(ЗаписьXML, СкладскиеЯчейки) Экспорт
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.СкладскиеЯчейки.Вручную");
	
	ЗаписатьXML(ЗаписьXML, СкладскиеЯчейки.Ссылка, "Ref", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, СкладскиеЯчейки.ЭтоГруппа, "IsGroup", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, СкладскиеЯчейки.Владелец, "Owner", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, СкладскиеЯчейки.Код, "Code", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, СкладскиеЯчейки.Наименование, "Description", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, СкладскиеЯчейки.Родитель, "Parent", НазначениеТипаXML.Явное);	
	ЗаписатьXML(ЗаписьXML, СкладскиеЯчейки.Помещение, "Premise", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, РаботаСШтрихкодами.ПолучитьШК(СкладскиеЯчейки.Ссылка), "Штрихкод", НазначениеТипаXML.Явное);

	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLСкладскиеПомещения(ЗаписьXML, СкладскиеПомещения) Экспорт
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.СкладскиеПомещения.Вручную");
	
	ЗаписатьXML(ЗаписьXML, СкладскиеПомещения.Ссылка, "Ref", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, СкладскиеПомещения.Владелец, "Owner", НазначениеТипаXML.Явное); 
	ЗаписатьXML(ЗаписьXML, СкладскиеПомещения.Наименование, "Description", НазначениеТипаXML.Явное);
		
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры 

Процедура ЗаписатьXMLНоменклатура(ЗаписьXML, Номенклатура) Экспорт 
	
	// TODO: ПОлучить штрихкода и записать в хмл ( можно передать структуру )
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Номенклатура.Вручную");
	
	СтруктураРеквизитов=РаботаСоСправочниками.ПолучитьСтруктуруНоменклатуры(Номенклатура.Ссылка);
	
	РаботаСоСправочниками.СтруктуруВЗаписьXML(ЗаписьXML,СтруктураРеквизитов);

	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры 

Процедура ЗаписатьXMLШтрихкодыУпаковокТоваров(ЗаписьXML, ШтрихкодУпаковокТоваров) Экспорт 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ШтрихкодУпаковокТоваров.Вручную");
	
	ЗаписатьXML(ЗаписьXML, ШтрихкодУпаковокТоваров.Ссылка, "Ref", НазначениеТипаXML.Явное); 
	ЗаписатьXML(ЗаписьXML, ШтрихкодУпаковокТоваров.Номенклатура, "Номенклатура", НазначениеТипаXML.Явное); 
	ЗаписатьXML(ЗаписьXML, ШтрихкодУпаковокТоваров.ЗначениеШтрихкода, "ЗначениеШтрихкода", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, ШтрихкодУпаковокТоваров.Характеристика, "Характеристика", НазначениеТипаXML.Явное); 
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLШтрихкодыНоменклатуры(ЗаписьXML, ШтрихкодНоменклатуры) Экспорт 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ШтрихкодНоменклатуры.Вручную");
	
	ЗначениеШтрихкода = ШтрихкодНоменклатуры.Отбор.Штрихкод.Значение; 
	ДанныеТовара = РаботаСШтрихкодами.ПолучитьДанныеТовараПоШК(ЗначениеШтрихкода);
	
	ЗаписатьXML(ЗаписьXML, ДанныеТовара.Номенклатура, "Номенклатура", НазначениеТипаXML.Явное); 
	ЗаписатьXML(ЗаписьXML, ДанныеТовара.Характеристика, "Характеристика", НазначениеТипаXML.Явное); 
	ЗаписатьXML(ЗаписьXML, ЗначениеШтрихкода, "ЗначениеШтрихкода", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, ДанныеТовара.Упаковка, "Упаковка", НазначениеТипаXML.Явное);
	КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ДанныеТовара.Упаковка, ДанныеТовара.Номенклатура);
	ЗаписатьXML(ЗаписьXML, КоэффициентУпаковки, "КоэффициентУпаковки", НазначениеТипаXML.Явное); 
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLНоменклатураУдаление(ЗаписьXML, Номенклатура) Экспорт 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.НоменклатураУдаление.Вручную");
	
	ЗаписатьXML(ЗаписьXML, Номенклатура.Ссылка, "Ref", НазначениеТипаXML.Явное);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLХарактеристикаНоменклатуры(ЗаписьXML, ХарактеристикаНоменклатуры) Экспорт
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ХарактеристикиНоменклатуры.Вручную");
	
	СтруктураРеквизитов=РаботаСоСправочниками.ПолучитьСтруктуруХарактеристики(ХарактеристикаНоменклатуры.Ссылка);
	
	РаботаСоСправочниками.СтруктуруВЗаписьXML(ЗаписьXML,СтруктураРеквизитов);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLСерию(ЗаписьXML, Серия) Экспорт 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.СерииНоменклатуры.Вручную");

	ЗаписатьXML(ЗаписьXML, Серия.Ссылка, "Ref", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, Серия.Наименование, "Description", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, Серия.ГоденДо, "ГоденДо", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, Серия.ВидНоменклатуры, "ВидНоменклатуры", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, Серия.Номер, "Номер", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, Серия.ДатаПроизводства, "ДатаПроизводства", НазначениеТипаXML.Явное);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLЗаказКлиента(ЗаписьXML, ЗаказКлиента, ПользовательТСД)Экспорт
    ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.ЗаказКлиента.Вручную");
	
	ЗаписатьXML(ЗаписьXML, ЗаказКлиента.Ссылка, "Ref", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, ЗаказКлиента.Номер, "Номер", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, ЗаказКлиента.Дата, "Дата", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, РаботаСТСД.ЗаказКлиентаВРаботеУПользователя(ПользовательТСД, ЗаказКлиента), "ЗаказКлиентаВРаботе", НазначениеТипаXML.Явное);
	
	ТЧрар_мп_ТоварыДляМаркировки = ЗаказКлиента.рар_мп_ТоварыДляМаркировки;
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТабличнаяЧасть");
	ЗаписьXML.ЗаписатьАтрибут("Имя", "рар_мп_ТоварыДляМаркировки");
	Для Каждого СтрокаТЧ Из ТЧрар_мп_ТоварыДляМаркировки Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаТЧ"); 
		
		ЗаписьXML.ЗаписатьАтрибут("Номенклатура", XMLСтрока(СтрокаТЧ.рар_мп_Номенклатура));
		ЗаписьXML.ЗаписатьАтрибут("ЧестныйЗнак", XMLСтрока(СтрокаТЧ.рар_мп_ЧестныйЗнак));
		ЗаписьXML.ЗаписатьАтрибут("Характеристика", XMLСтрока(СтрокаТЧ.рар_мп_Характеристика));
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ЗаписатьXMLРеестрЗаказов(ЗаписьXML, РеестрЗаказов, ПользовательТСД) Экспорт

	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.РеестрЗаказов.Вручную");
	
	ЗаписатьXML(ЗаписьXML, РеестрЗаказов.Ссылка, "Ref", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, РеестрЗаказов.Номер, "Номер", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, РеестрЗаказов.Дата, "Дата", НазначениеТипаXML.Явное);
	ЗаписатьXML(ЗаписьXML, РаботаСТСД.РеестрЗаказовВРаботеУПользователя(ПользовательТСД, РеестрЗаказов), "РеестрЗаказовВРаботе", НазначениеТипаXML.Явное);
	
	ТЧрар_мп_МаркируемыеТовары = РеестрЗаказов.рар_мп_МаркируемыеТовары;
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТабличнаяЧасть");
	ЗаписьXML.ЗаписатьАтрибут("Имя", "рар_мп_МаркируемыеТовары");
	Для Каждого СтрокаТЧ Из ТЧрар_мп_МаркируемыеТовары Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаТЧ"); 
		
		ЗаписьXML.ЗаписатьАтрибут("Номенклатура", XMLСтрока(СтрокаТЧ.рар_мп_Номенклатура));
		ЗаписьXML.ЗаписатьАтрибут("ЧестныйЗнак", XMLСтрока(СтрокаТЧ.рар_мп_ЧестныйЗнак));
		ЗаписьXML.ЗаписатьАтрибут("Характеристика", XMLСтрока(СтрокаТЧ.рар_мп_Характеристика));
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

#КонецОбласти

#Область ПринятиеДанных
Процедура ПринятьПакетОбмена(УзелОбмена, ДанныеОбмена) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	
	Попытка 
		НачатьТранзакцию();
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
		
		ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
		
		Пока ВозможностьЧтенияДанных(ЧтениеXML) Цикл
			Данные = ПрочитатьДанные(ЧтениеXML);
			Если Не Данные = Неопределено Тогда
				
				//Если Не ПринятьИзменения(ЧтениеСообщения.Отправитель, Данные) Тогда
				//	Продолжить;
				//КонецЕсли;
				
				Данные.ОбменДанными.Отправитель = ЧтениеСообщения.Отправитель;			
				Данные.ОбменДанными.Загрузка = Истина;
				Данные.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЧтениеСообщения.ЗакончитьЧтение();
		ЧтениеXML.Закрыть();
		ЗафиксироватьТранзакцию();
	Исключение 
		ОтменитьТранзакцию();
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Процедура ПринятьПакетОбмена'"),
						        УровеньЖурналаРегистрации.Ошибка,
						        ,
						        ,
						        Ошибка);
	КонецПопытки;
КонецПроцедуры

Функция ВозможностьЧтенияДанных(ЧтениеXML) Экспорт
	// Получаем тип данных XML, который может быть считан в данный момент.
	
	ТипXML = ПолучитьXMLТип(ЧтениеXML);
	
	Если ТипXML = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ВозможностьЧтенияXML(ЧтениеXML);
	
КонецФункции

Функция ПрочитатьДанные(ЧтениеXML) Экспорт
	ТипXML = ПолучитьXMLТип(ЧтениеXML);
	
	Если ТипXML = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	// Пытаемся прочесть значение из объекта ЧтениеXML стандартным образом.
	Возврат ПрочитатьXML(ЧтениеXML);
КонецФункции // ПрочитатьДанные(ЧтениеXML)

#КонецОбласти
#Область ЧтениеДанных

Функция ПринятьИзменения(Отправитель, Данные) Экспорт
	Прием = Истина;
	Возврат Прием;
КонецФункции

Процедура РегистрацияДокументовКОбменуПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Источник.ЭтоНовый() Тогда   
		НовыйГУИД  = Новый УникальныйИдентификатор();
		НоваяСсылка = Документы[Источник.Метаданные().Имя].ПолучитьСсылку(НовыйГУИД);
		Источник.УстановитьСсылкуНового(НоваяСсылка); 
	ИНаче
		НоваяСсылка = Источник.Ссылка;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказКлиента") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.рар_мп_РеестрЗаказов") Тогда
		Если Источник.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Новый 
			ИЛИ Источник.ДополнительныеСвойства.Свойство("ЗарегистрироватьДокументКОбменуНаТСД") Тогда
			МассивУзлов = СформироватьМассивУзловДляРегистрации();
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НоваяСсылка);
		ИначеЕсли Источник.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.ВРаботе Тогда
			Если Источник.ДополнительныеСвойства.Свойство("ВзятиеДокументаВРаботуИзТСД") Тогда 
				МассивУзлов = СформироватьМассивУзловДляРегистрацииЗаИсключениемПользователя(Источник.рар_мп_ПользовательТСД);
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НоваяСсылка); 
			Иначе
				МассивУзлов = СформироватьМассивУзловДляРегистрации();
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НоваяСсылка);
			КонецЕсли;
		ИначеЕсли Источник.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Завершен Тогда 
			Если Источник.ДополнительныеСвойства.Свойство("ЗвершениеДокументаИзТСД") Тогда
				МассивУзлов = СформироватьМассивУзловДляРегистрацииЗаИсключениемПользователя(Источник.рар_мп_ПользовательТСД);
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НоваяСсылка);
			Иначе
				МассивУзлов = СформироватьМассивУзловДляРегистрации();
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НоваяСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
